---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.AsDouble
source: html/a59e3097-222c-8c71-afbe-0baf34571add.htm
---
# Autodesk.Revit.DB.IFC.IFCData.AsDouble Method

Gets storage value as double when its PrimitiveType is double.

## Syntax (C#)
```csharp
public double AsDouble()
```

## Returns
The double value.

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - The primitive type is not double.